In [1]:
import tabula
import pandas as pd 
import datetime
import boto3

In [39]:
def to_date(x):
    try:
        x = list(map(int, x.split('-')))
        date = datetime.date(x[0],x[1],x[2])
    except Exception as e:
        print(e) 
        date = None

    return date


def extract_pdf(pdf_url):
    df = pd.concat(tabula.read_pdf(pdf_url, pages = 'all'))
    df['date_payment_confirmed'] = df['date_payment_confirmed'].apply(to_date)
    df['expiry_date'] = pd.to_datetime(df['expiry_date'],format = '%m/%y',errors= 'coerce').dt.date
    return df

In [40]:
pdf_url = 'https://data-handling-public.s3.eu-west-1.amazonaws.com/card_details.pdf'

card_data = extract_pdf(pdf_url)

invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'GTC9KBWJO9'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'DJIXF1AFAZ'
invalid literal for int() with base 10: 'December 2021 17'
invalid literal for int() with base 10: '2005 July 01'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'H2PCQP4W50'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'XTD27ANR5Q'
invalid literal for int() with base 10: '7VGB4DA1WI'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'RLQYRRYHPU'
invalid literal for int() with base 10: 'December 2000 01'
invalid literal for int() with base 10: '2008 May 11'
invalid literal for int() with base 10: 'T008RE1ZR6'
invalid literal for int() with base 10: '7FL8EU9GBF'
invalid literal for int() with base 10: 'GD9PHJXQR4'
invalid literal for int() with base 10: 'WCK463ZO1Z'
invalid literal for int() with base 10: 'October 2000 04'
invalid literal for int() with base 10: 'OE3KONN2V6'
invalid literal for int() with base 10: 'T995FX2C7W'
invalid literal for int() with base 10: 'EVVMMB3QYV'
invalid literal for int() with base 10: 'September 2016 04'
invalid literal for int() with base 10: '2017/05/15'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'NULL'
invalid literal for int() with base 10: 'UZGSD0AEBT'
invalid literal for int() with base 10: 'May 1998 09'

In [13]:
card_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15309 entries, 0 to 18
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   card_number             15309 non-null  object
 1   expiry_date             15284 non-null  object
 2   card_provider           15309 non-null  object
 3   date_payment_confirmed  15276 non-null  object
dtypes: object(4)
memory usage: 598.0+ KB

In [14]:
card_data

,card_number,expiry_date,card_provider,date_payment_confirmed
0,30060773296197,2026-09-01,Diners Club / Carte Blanche,2015-11-25
1,349624180933183,2023-10-01,American Express,2001-06-18
2,3529023891650490,2023-06-01,JCB 16 digit,2000-12-26
3,213142929492281,2027-09-01,JCB 15 digit,2011-02-12
4,502067329974,2025-10-01,Maestro,1997-03-13
...,...,...,...,...
14,180036921556789,2028-12-01,JCB 15 digit,1997-06-06
15,180018030448512,2024-11-01,JCB 15 digit,2004-06-16
16,3569953313547220,2024-04-01,JCB 16 digit,2020-02-05
17,4444521712606810,2027-06-01,VISA 16 digit,2008-06-16
18,372031786522735,2030-02-01,American Express,2009-02-04

In [15]:
card_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15309 entries, 0 to 18
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   card_number             15309 non-null  object
 1   expiry_date             15284 non-null  object
 2   card_provider           15309 non-null  object
 3   date_payment_confirmed  15276 non-null  object
dtypes: object(4)
memory usage: 598.0+ KB

In [16]:
card_data.isna().sum()

card_number                0
expiry_date               25
card_provider              0
date_payment_confirmed    33
dtype: int64

In [17]:
card_data['card_number'].astype(int)

ValueError: invalid literal for int() with base 10: '?4971858637664481'

In [25]:
def clean_questionmark(x):
    try:
        if x == "NULL":
            return None
        x = str(x).replace('?',"")
        return x 
    except Exception as e:
        print(e)

In [28]:
card_data['card_number'] = card_data['card_number'].apply(clean_questionmark)

In [29]:
card_data.isna().sum()

card_number               11
expiry_date               25
card_provider              0
date_payment_confirmed    33
dtype: int64

In [35]:
(card_data['card_provider'] == 'NULL').sum()

11

In [34]:
card_data.isna().sum()

card_number               11
expiry_date               25
card_provider              0
date_payment_confirmed    33
dtype: int64

In [36]:
card_data.loc[card_data['card_provider'] == 'NULL', 'card_provider'] = None

In [37]:
card_data.isna().sum()

card_number               11
expiry_date               25
card_provider             11
date_payment_confirmed    33
dtype: int64

In [38]:
def clean_card_data(card_data):
    card_data['card_number'] = card_data['card_number'].apply(clean_questionmark)
    card_data.loc[card_data['card_provider'] == 'NULL', 'card_provider'] = None
    return card_data.dropna()

In [41]:
new_data = clean_card_data(card_data)

In [42]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15276 entries, 0 to 18
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   card_number             15276 non-null  object
 1   expiry_date             15276 non-null  object
 2   card_provider           15276 non-null  object
 3   date_payment_confirmed  15276 non-null  object
dtypes: object(4)
memory usage: 596.7+ KB

In [43]:
new_data.isna().sum()

card_number               0
expiry_date               0
card_provider             0
date_payment_confirmed    0
dtype: int64

In [45]:
(new_data['card_number']== 'NULL').sum()

0

In [1]:
from data_extraction import DataExtractor

In [2]:
extractor = DataExtractor("www.test.com")

In [4]:
df_stores = extractor.retrieve_stores_data('https://aqj7u5id95.execute-api.eu-west-1.amazonaws.com/prod/store_details/{store_number}')

In [5]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 451 entries, 0 to 450
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   address        451 non-null    object
 1   longitude      451 non-null    object
 2   lat            11 non-null     object
 3   locality       451 non-null    object
 4   store_code     451 non-null    object
 5   staff_numbers  451 non-null    object
 6   opening_date   451 non-null    object
 7   store_type     451 non-null    object
 8   latitude       450 non-null    object
 9   country_code   451 non-null    object
 10  continent      451 non-null    object
dtypes: object(11)
memory usage: 42.3+ KB

In [12]:
df_stores.head()

,address,longitude,locality,store_code,staff_numbers,opening_date,store_type,latitude,country_code,continent
index,,,,,,,,,,
0,N/A,N/A,N/A,WEB-1388012W,325,2010-06-12,Web Portal,None,GB,Europe
1,"Flat 72W Sally isle East Deantown E7B 8EB, Hig...",51.62907,High Wycombe,HI-9B97EE4E,34,1996-10-25,Local,-0.74934,GB,Europe
2,"HeckerstraÃŸe 4/5 50491 SÃ¤ckingen, Landshut",48.52961,Landshut,LA-0772C7B9,92,2013-04-12,Super Store,12.16179,DE,Europe
3,"5 Harrison tunnel South Lydia WC9 2BE, Westbury",51.26,Westbury,WE-1DE82CEE,69,2014-01-02,Super Store,-2.1875,GB,Europe
4,"Studio 6 Stephen landing South Simon B77 2WA, ...",53.0233,Belper,BE-18074576,35,2019-09-09,Local,-1.48119,GB,Europe

In [21]:
df_stores.drop('lat', inplace = True, axis = 1)
df_stores.drop(447, inplace= True)

In [10]:
df_stores['address'].apply(lambda x: x.replace('\n', ' '))

index
0                                                    N/A
1      Flat 72W Sally isle East Deantown E7B 8EB, Hig...
2             HeckerstraÃŸe 4/5 50491 SÃ¤ckingen, Landshut
3        5 Harrison tunnel South Lydia WC9 2BE, Westbury
4      Studio 6 Stephen landing South Simon B77 2WA, ...
                             ...
446       TÃ¤schestraÃŸe 25 39039 NÃ¶rdlingen, Kirchlengern
447                                           K0ODETRLS3
448    Studio 8 Moss mall West Linda M0E 6XR, High Wy...
449                  Baumplatz 6 80114 KÃ¶tzting, Bretten
450    Gotthilf-Rose-StraÃŸe 7/3 45457 Feuchtwangen, B...
Name: address, Length: 451, dtype: object

In [11]:
df_stores['address'] = df_stores['address'].apply(lambda x: x.replace('\n', ' '))

In [17]:
df_stores.loc[(df_stores['longitude'] == 'N/A'),'longitude'] = None

In [27]:
def convert_to_num(x, type_1):
    try:
        return type_1(x) 
    except: 
        return None

In [30]:
df_stores['longitude'] = df_stores['longitude'].apply(convert_to_num, type_1 = float)
df_stores['latitude'] = df_stores['latitude'].apply(convert_to_num, type_1 = float)
df_stores['staff_numbers'] = df_stores['staff_numbers'].apply(convert_to_num, type_1 = int)

In [33]:
df_stores['opening_date'].apply(convert_to_num, type_1 = datetime.date)

index
0      None
1      None
2      None
3      None
4      None
       ...
445    None
446    None
448    None
449    None
450    None
Name: opening_date, Length: 450, dtype: object

In [35]:
def date_format(x):
    try: 
        if '-' in x:
            x = list(map(int, x.split('-')))
            return datetime.date(x[0],x[1],x[2])
        else:
            return datetime.datetime.strptime(x, '%B %Y %d').date()
    except: 
        return None

In [36]:
df_stores['opening_date'].apply(date_format)

index
0      2010-06-12
1      1996-10-25
2      2013-04-12
3      2014-01-02
4      2019-09-09
          ...
445    2008-06-08
446    2005-05-12
448    1998-05-14
449    2020-10-17
450    2001-05-12
Name: opening_date, Length: 450, dtype: object

In [37]:
df_stores['opening_date']= df_stores['opening_date'].apply(date_format)

In [38]:
df_stores.head()

,address,longitude,locality,store_code,staff_numbers,opening_date,store_type,latitude,country_code,continent
index,,,,,,,,,,
0,N/A,NaN,N/A,WEB-1388012W,325.0,2010-06-12,Web Portal,NaN,GB,Europe
1,"Flat 72W Sally isle East Deantown E7B 8EB, Hig...",51.62907,High Wycombe,HI-9B97EE4E,34.0,1996-10-25,Local,-0.74934,GB,Europe
2,"HeckerstraÃŸe 4/5 50491 SÃ¤ckingen, Landshut",48.52961,Landshut,LA-0772C7B9,92.0,2013-04-12,Super Store,12.16179,DE,Europe
3,"5 Harrison tunnel South Lydia WC9 2BE, Westbury",51.26000,Westbury,WE-1DE82CEE,69.0,2014-01-02,Super Store,-2.18750,GB,Europe
4,"Studio 6 Stephen landing South Simon B77 2WA, ...",53.02330,Belper,BE-18074576,35.0,2019-09-09,Local,-1.48119,GB,Europe

In [39]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 450 entries, 0 to 450
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   address        450 non-null    object
 1   longitude      440 non-null    float64
 2   locality       450 non-null    object
 3   store_code     450 non-null    object
 4   staff_numbers  436 non-null    float64
 5   opening_date   435 non-null    object
 6   store_type     450 non-null    object
 7   latitude       440 non-null    float64
 8   country_code   450 non-null    object
 9   continent      450 non-null    object
dtypes: float64(3), object(7)
memory usage: 38.7+ KB

In [42]:
for col in df_stores.columns: 
    df_stores[col] = df_stores[col].replace({'N/A': None})

In [44]:
df_stores.isna().sum()

address           1
longitude        10
locality          1
store_code        0
staff_numbers    14
opening_date     15
store_type        0
latitude         10
country_code      0
continent         0
dtype: int64

In [46]:
df_stores.dropna(inplace = True)

In [47]:
df_stores.isna().sum()

address          0
longitude        0
locality         0
store_code       0
staff_numbers    0
opening_date     0
store_type       0
latitude         0
country_code     0
continent        0
dtype: int64

In [48]:
df_stores.head()

,address,longitude,locality,store_code,staff_numbers,opening_date,store_type,latitude,country_code,continent
index,,,,,,,,,,
1,"Flat 72W Sally isle East Deantown E7B 8EB, Hig...",51.62907,High Wycombe,HI-9B97EE4E,34.0,1996-10-25,Local,-0.74934,GB,Europe
2,"HeckerstraÃŸe 4/5 50491 SÃ¤ckingen, Landshut",48.52961,Landshut,LA-0772C7B9,92.0,2013-04-12,Super Store,12.16179,DE,Europe
3,"5 Harrison tunnel South Lydia WC9 2BE, Westbury",51.26000,Westbury,WE-1DE82CEE,69.0,2014-01-02,Super Store,-2.18750,GB,Europe
4,"Studio 6 Stephen landing South Simon B77 2WA, ...",53.02330,Belper,BE-18074576,35.0,2019-09-09,Local,-1.48119,GB,Europe
5,Flat 92u Christian harbors Port Charlotte N57 ...,53.38333,Gainsborough,GA-CAD01AC2,36.0,1995-05-15,Local,-0.76667,GB,Europe

In [53]:
for col in df_stores.columns: 
    print(type(df_stores[col].iloc[0]))

<class 'str'>
<class 'numpy.float64'>
<class 'str'>
<class 'str'>
<class 'numpy.float64'>
<class 'datetime.date'>
<class 'str'>
<class 'numpy.float64'>
<class 'str'>
<class 'str'>

In [55]:
def get_type(col_type):
    if 'str' in str(col_type):
        return 'VARCHAR(225)'
    elif 'float' in str(col_type):
        return 'FLOAT'
    elif 'int' in str(col_type): 
        return 'INT'
    elif 'date' in str(col_type):
        return 'DATE'
    else: 
        return 'VARCHAR(225)'

In [56]:
for col in df_stores.columns: 
    print(get_type(type(df_stores[col].iloc[0])))

VARCHAR(225)
FLOAT
VARCHAR(225)
VARCHAR(225)
FLOAT
DATE
VARCHAR(225)
FLOAT
VARCHAR(225)
VARCHAR(225)

In [102]:
s3 = boto3.client('s3', region_name = 'eu-west-1', aws_access_key_id = 'aiufnioewnrvoiw', aws_secret_access_key = 'aiowuerniunwviunw')

In [103]:
obj = s3.get_object(Bucket = 'data-handling-public', Key =  'products.csv')

In [105]:
df_products = pd.read_csv(obj['Body'], index_col = 0)

In [106]:
df_products

,product_name,product_price,weight,category,EAN,date_added,uuid,removed,product_code
0,FurReal Dazzlin' Dimples My Playful Dolphin,Â£39.99,1.6kg,toys-and-games,7425710935115,2005-12-02,83dc0a69-f96f-4c34-bcb7-928acae19a94,Still_avaliable,R7-3126933h
1,Tiffany's World Day Out At The Park,Â£12.99,0.48kg,toys-and-games,487128731892,2006-01-09,712254d7-aea7-4310-aff8-8bcdd0aec7ff,Still_avaliable,C2-7287916l
2,Tiffany's World Pups Picnic Playset,Â£7.00,590g,toys-and-games,1945816904649,1997-03-29,b089ef6f-b628-4e37-811d-fffe0102ba64,Still_avaliable,S7-1175877v
3,Tiffany's World Wildlife Park Adventures,Â£12.99,540g,toys-and-games,1569790890899,2013-03-20,d55de422-8b98-47d6-9991-e4bc4c5c0cb0,Removed,D8-8421505n
4,Cosatto Cosy Dolls Pram,Â£30.00,1.91kg,toys-and-games,7142740213920,2007-12-23,7945b657-cb02-4cc5-96cf-f65ed0a8f235,Still_avaliable,B6-2596063a
...,...,...,...,...,...,...,...,...,...
1848,Goodmans Qi Autosense In Car Phone Holder,Â£15.00,125g,diy,8185827751600,2020-08-28,3ff21cb1-8e90-499d-b5a0-6839fb83e70f,Still_avaliable,x4-2227164k
1849,Goodmans Qi Wireless Charging Phone Stand,Â£15.00,134g,diy,9769724533935,2012-05-20,a7910f74-c2b6-4144-98b7-30ca68f34d2d,Still_avaliable,i3-8338545Z
1850,RAC 12V Wet & Dry Vacuum,Â£18.00,820g,diy,3113855860327,1993-11-28,66d3efa0-f480-4da9-893b-e8aaff53e27b,Still_avaliable,n4-1642658b
1851,Goodmans Qi Autosense In Car Phone Holder,Â£15.00,125g,diy,9195087467400,2016-09-20,efb472f1-8f00-448e-a874-9fa9812eeab5,Still_avaliable,A3-7619070S
1852,Beldray Telescopic Ladder 2.9m,Â£69.00,9.4kg,diy,8518402353072,2006-10-07,cfe701da-6493-4a7f-83cf-9aab1650f689,Still_avaliable,i6-2851854w

In [107]:
def clean_weights(x):
    if type(x) == float:
        return x 
    elif 'kg' in x:
        return float(x.replace('kg', ''))*1000
    elif 'ml' in x: 
        return float(x.replace('ml', ''))
    elif x.isnumeric():
        return float(x)   
    elif 'g' in x:
        if 'x' in x:
            x = x.replace('g', '').replace(' ', '')
            x = x.split('x')
            result = 1 
            for item in x: 
                result = result * float(item)
            return result 
        return float(x.replace('g', '').replace(' ', ''))
    elif 'oz' in x:
        return float(x.replace('oz', ''))*28.35
    else: 
        print(x) 
        return None

In [108]:
def convert_product_weights(df):
    df['weight'] = df['weight'].apply(clean_weights)

    return df

In [109]:
df_products = convert_product_weights(df_products)

9GO9NZ5JTL
Z8ZTDGUZVU
MX180RYSHX

In [110]:
def clean_money(x):
    if type(x) == float:
        return x 
    if 'Â£' in x: 
        return float(x.replace('Â£', ''))
    else: 
        return None

In [111]:
def date_format(x):
    try: 
        if '-' in x:
            x = list(map(int, x.split('-')))
            return datetime.date(x[0],x[1],x[2])
        else:
            return datetime.datetime.strptime(x, '%B %Y %d').date()
    except: 
        return None

In [112]:
def clean_products_data(df):
    df['product_price'] = df['product_price'].apply(clean_money)
    df['date_added'] = df['date_added'].apply(date_format)
    df.dropna(inplace = True)
    return df

In [113]:
df_products = clean_products_data(df_products)

In [114]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1845 entries, 0 to 1852
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_name   1845 non-null   object
 1   product_price  1845 non-null   float64
 2   weight         1845 non-null   float64
 3   category       1845 non-null   object
 4   EAN            1845 non-null   object
 5   date_added     1845 non-null   object
 6   uuid           1845 non-null   object
 7   removed        1845 non-null   object
 8   product_code   1845 non-null   object
dtypes: float64(2), object(7)
memory usage: 144.1+ KB

In [115]:
df_products.dtypes

product_name      object
product_price    float64
weight           float64
category          object
EAN               object
date_added        object
uuid              object
removed           object
product_code      object
dtype: object

datetime.date(2000, 10, 16)